import React,{useState} from "react";


function UserReview(){
    const UserReviews = [
        {
          id: 1,
          bookName: "သားရဲစိတ်ဓာတ် (ဘာသာပြန်) ချမ်းမြေ့ဝင်း",
          review:
            "သားရဲစိတ်ဓာတ် စာအုပ်ဟာ Comfort zone က ထွက်ပြီး ကျနော်တို့ရဲ့ အတွေးအခေါ်တွေရဲရင့်လာအောင်၊ " +
            "ကိုယ့်ကိုယ်ကိုကို ယုံကြည်မှုတိုးလာအောင်၊ လက်ဆုတ်လက်ကိုင်ပြနိုင်မဲ့ ပန်းတိုင်းတွေဟာ အတွေးအခေါ်က စတင်ကြောင်း၊ " +
            "အတွေးအခေါ် အမြင်တွေ မတူတဲ့ရပ်ဝန်းမှာ မတူတာကို တန်ဖိုးထားပြီး ပိုမိုကောင်းမွန်တဲ့ အတွေးသစ်တွေကို ဖော်ဆောင်တတ်အောင် " +
            "စိတ်ဓာတ်ခွန်အားပေးမဲ့ စာပေပဲဖြစ်ပါတယ်။ ဒီစာအုပ်မှာ အပိုင်း (၁၀) ပိုင်းပါရှိပြီး အဖြစ်အပျက်ပေါင်း (၆၀) ကျော်ကို " +
            "သာဓကကောင်းအဖြစ် ဖော်ပြထားပါတယ်။ ဖတ်ရတာ ပျင်းရိမနေပဲ စိတ်ဝင်စဖွယ်ကောင်းသလို သင်ယူစရာ၊ ခွန်အားဖြစ်စရာ တွေ အပြည့်ရှိကြောင်း " +
            "အာမခံပါရစေ။ မူရင်းစာရေးဆရာဟာ ကြော်ငြာလောကရဲ့ ဆရာတစ်ဆူဖြစ်တဲ့အလျှောက် အဖြစ်အပျက်တချို့ဟာ စာရေးဆရာရဲ့ " +
            "လုပ်ငန်းခွင်အတွင်း တွေ့ကြုံရသော အဖြစ်အပျက်များကို လူတွေရဲ့ စိတ်နေသဘောသဘာဝ နဲ့ ချိတ်ဆက် ဖော်ပြထားတာပဲဖြစ်တဲ့အပြက် " +
            "အခြားနယ်ပယ်မျိုးစုံမှလဲ ရှုထောင့်အမျိုးမျိုးနဲ့ ရေးသားတင်ပြထားတာပဲဖြစ်ပါတယ်။",
          user: "BookReviewsByMSL",
        },
      ];
    
      const ReviewsList = UserReviews.map((userReview) => (
        <li key={userReview.id}>
          <b>{userReview.bookName}</b> :<br /> &nbsp; {userReview.review.split("\n").map((line, index) => (
      <React.Fragment key={index}>
        {line}
        <br />
      </React.Fragment>
    ))} "from"{" "}
          <b>{userReview.user}</b>
        </li>
      ));
    
      return (
        <> 
      <ol className="userReviewsList">{ReviewsList}</ol>
      </>);
    }
export default UserReview